zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
static uint32_t HAL_NAND_ReadData32(NAND_HandleTypeDef *restrict hnand)
{
  uint32_t data = *(__IO uint32_t *)(hnand->DeviceAddress);
  __DSB();
  return data;
}

static uint32_t HAL_NAND_Read_Status_Internal(NAND_HandleTypeDef *hnand)
{
  uint32_t nandStatus;
  uint32_t data;

  /* Send Read status operation command */
  HAL_NAND_WriteCommand(hnand, NAND_CMD_STATUS);

  /* Read status register data */
  data = HAL_NAND_ReadData8(hnand);

  /* Return the status */
  if ((data & NAND_ERROR) == NAND_ERROR)
  {
    nandStatus = NAND_ERROR;
  }
  else if ((data & NAND_READY) == NAND_READY)
  {
    nandStatus = NAND_READY;
  }
  else
  {
    nandStatus = NAND_BUSY;
  }

  return nandStatus;
}

static HAL_StatusTypeDef HAL_NAND_WaitReady(NAND_HandleTypeDef *hnand, uint32_t TimeOut)
{
  uint32_t nandStatus;
  /* Get tick */
  uint32_t tickstart = HAL_GetTick();

  /* Read status until NAND is ready */
  do
  {
    nandStatus = HAL_NAND_Read_Status_Internal(hnand);
    if (nandStatus != NAND_BUSY)
    {
      if (nandStatus == NAND_READY)
      {
        return HAL_OK;
      }
      else
      {
        return HAL_ERROR;
      }
    }
  } while ((HAL_GetTick() - tickstart) <= TimeOut);

  hnand->State = HAL_NAND_STATE_ERROR;
  hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
  return HAL_TIMEOUT;
}

static void HAL_NAND_SetAddress(NAND_HandleTypeDef *restrict hnand, uint32_t NandAddress, uint32_t ColumnAddress)
{
  uint32_t totalPageNumber = hnand->Config.BlockSize * hnand->Config.BlockNbr;
  uint32_t columnAddressInBytes = HAL_NAND_ComputeWordsToBytes(ColumnAddress, hnand->Init.MemoryDataWidth);

  /* Cards with page size <= 512 bytes */
  if ((hnand->Config.PageSize) <= NAND_PAGE_SIZE_512)
  {
    HAL_NAND_WriteAddress(hnand, 0x00U);
    HAL_NAND_WriteAddress(hnand, ADDR_1ST_CYCLE(NandAddress));
    HAL_NAND_WriteAddress(hnand, ADDR_2ND_CYCLE(NandAddress));
    if (totalPageNumber > NAND_MAX_PAGES_FOR_16BIT_ADDRESS)
    {
      HAL_NAND_WriteAddress(hnand, ADDR_3RD_CYCLE(NandAddress));
    }
  }
  else /* (hnand->Config.PageSize) > 512 */
  {
    HAL_NAND_WriteAddress(hnand, COLUMN_1ST_CYCLE(columnAddressInBytes));
    HAL_NAND_WriteAddress(hnand, COLUMN_2ND_CYCLE(columnAddressInBytes));
    HAL_NAND_WriteAddress(hnand, ADDR_1ST_CYCLE(NandAddress));
    HAL_NAND_WriteAddress(hnand, ADDR_2ND_CYCLE(NandAddress));
    if (totalPageNumber > NAND_MAX_PAGES_FOR_16BIT_ADDRESS)
    {
      HAL_NAND_WriteAddress(hnand, ADDR_3RD_CYCLE(NandAddress));
    }
  }
}

static HAL_StatusTypeDef HAL_NAND_ReadBegin(NAND_HandleTypeDef *restrict hnand, uint32_t NandAddress,
                                            uint32_t ColumnAddress)
{
  HAL_StatusTypeDef status;

  HAL_NAND_WriteCommand(hnand, NAND_CMD_AREA_A);
  HAL_NAND_SetAddress(hnand, NandAddress, ColumnAddress);
  HAL_NAND_WriteCommand(hnand, NAND_CMD_AREA_TRUE1);

  if (hnand->Config.ExtraCommandEnable == ENABLE)
  {
    status = HAL_NAND_WaitReady(hnand, NAND_READ_BEGIN_TIMEOUT);
    if (status != HAL_OK)
    {
      return status;
    }

    /* Go back to read mode */
    HAL_NAND_WriteCommand(hnand, NAND_CMD_AREA_A);
  }

  return HAL_OK;
}

static void HAL_NAND_WriteBegin(NAND_HandleTypeDef *restrict hnand, uint32_t NandAddress, uint32_t ColumnAddress,
                                uint32_t Area)
{
  /* The following line is not needed for recent NANDs. */
  HAL_NAND_WriteCommand(hnand, (Area == (uint32_t)NAND_AREA_SPARE) && (hnand->Config.PageSize <= NAND_PAGE_SIZE_512) ?
                        NAND_CMD_AREA_C : NAND_CMD_AREA_A);

  HAL_NAND_WriteCommand(hnand, NAND_CMD_WRITE0);
  HAL_NAND_SetAddress(hnand, NandAddress, ColumnAddress);
}

static HAL_StatusTypeDef HAL_NAND_WriteEnd(NAND_HandleTypeDef *restrict hnand)
{
  HAL_NAND_WriteCommand(hnand, NAND_CMD_WRITE_TRUE1);
  return HAL_NAND_WaitReady(hnand, NAND_WRITE_END_TIMEOUT);
}

static void HAL_NAND_ChangeReadColumn(NAND_HandleTypeDef *restrict hnand, uint32_t ColumnAddress)
{
  uint32_t columnAddressInBytes = HAL_NAND_ComputeWordsToBytes(ColumnAddress, hnand->Init.MemoryDataWidth);
  HAL_NAND_WriteCommand(hnand, NAND_CMD_RANDOM_OUTPUT_0);
  HAL_NAND_WriteAddress(hnand, COLUMN_1ST_CYCLE(columnAddressInBytes));
  HAL_NAND_WriteAddress(hnand, COLUMN_2ND_CYCLE(columnAddressInBytes));
  HAL_NAND_WriteCommand(hnand, NAND_CMD_RANDOM_OUTPUT_1);
}

static void HAL_NAND_ChangeWriteColumn(NAND_HandleTypeDef *restrict hnand, uint32_t ColumnAddress)
{
  uint32_t columnAddressInBytes = HAL_NAND_ComputeWordsToBytes(ColumnAddress, hnand->Init.MemoryDataWidth);
  HAL_NAND_WriteCommand(hnand, NAND_CMD_RANDOM_INPUT);
  HAL_NAND_WriteAddress(hnand, COLUMN_1ST_CYCLE(columnAddressInBytes));
  HAL_NAND_WriteAddress(hnand, COLUMN_2ND_CYCLE(columnAddressInBytes));
}

static void HAL_NAND_ReadFromDevice8(uint32_t DeviceAddress, uint32_t Size, uint8_t *pBuffer)
{
  uint32_t index;
  for (index = 0U; index < Size; index++)
  {
    pBuffer[index] = *(__IO uint8_t *)DeviceAddress;
    __DSB();
  }
}

static void HAL_NAND_ReadFromDevice16(uint32_t DeviceAddress, uint32_t Size, uint16_t *pBuffer)
{
  uint32_t index;
  for (index = 0U; index < Size; index++)
  {
    pBuffer[index] = *(__IO uint16_t *)DeviceAddress;
    __DSB();
  }
}

static void HAL_NAND_ReadFromDevice(NAND_HandleTypeDef *restrict hnand, uint32_t Size, void *pBuffer, uint32_t Offset)
{
  if (hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8)
  {
    HAL_NAND_ReadFromDevice8(hnand->DeviceAddress, Size, &((uint8_t *)pBuffer)[Offset]);
  }
  else
  {
    HAL_NAND_ReadFromDevice16(hnand->DeviceAddress, Size, &((uint16_t *)pBuffer)[Offset]);
  }
}

static void HAL_NAND_WriteToDevice8(uint32_t DeviceAddress, uint32_t Size, uint8_t *pBuffer)
{
  uint32_t index;
  for (index = 0U; index < Size; index++)
  {
    *(__IO uint8_t *)DeviceAddress = pBuffer[index];
    __DSB();
  }
}

static void HAL_NAND_WriteToDevice16(uint32_t DeviceAddress, uint32_t Size, uint16_t *pBuffer)
{
  uint32_t index;
  for (index = 0U; index < Size; index++)
  {
    *(__IO uint16_t *)DeviceAddress = pBuffer[index];
    __DSB();
  }
}

static void HAL_NAND_WriteToDevice(NAND_HandleTypeDef *restrict hnand, uint32_t Size, void *pBuffer, uint32_t Offset)
{
  if (hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8)
  {
    HAL_NAND_WriteToDevice8(hnand->DeviceAddress, Size, &((uint8_t *)pBuffer)[Offset]);
  }
  else
  {
    HAL_NAND_WriteToDevice16(hnand->DeviceAddress, Size, &((uint16_t *)pBuffer)[Offset]);
  }
}

/**
  * @brief  Read the NAND memory electronic signature
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pNAND_ID NAND ID structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Read_ID(NAND_HandleTypeDef *hnand, NAND_IDTypeDef *pNAND_ID)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t data = 0;
  uint32_t data1 = 0;

  /* Process Locked */
  __HAL_LOCK(hnand);

  /* Check the NAND controller state */
  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

