zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
    /* NAND raw address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    /* Page(s) read loop */
    if (nandAddress < nandAddressMax)
    {
      /* Begin reading */
      status = HAL_NAND_ReadBegin(hnand, nandAddress, Offset);
      if (status == HAL_OK)
      {
        /* Get data into buffer */
        HAL_NAND_ReadFromDevice(hnand, Length, pBuffer, 0);
      }
    }

    if (status == HAL_OK)
    {
      hnand->State = HAL_NAND_STATE_READY;
    }
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Read in a single page from NAND memory block (8-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @param  Offset  offset in the page
  * @param  Length  length to read
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Read_SinglePage_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                              uint8_t *pBuffer, uint32_t Offset, uint32_t Length)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Read_SinglePage(hnand, pAddress, pBuffer, Offset, Length);
}

/**
  * @brief  Read in a single page from NAND memory block (16-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer. pBuffer should be 16-bit aligned
  * @param  Offset  offset in the page
  * @param  Length  length to read
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Read_SinglePage_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                               uint16_t *pBuffer, uint32_t Offset, uint32_t Length)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Read_SinglePage(hnand, pAddress, pBuffer, Offset, Length);
}

/**
  * @brief  Write Page(s) to NAND memory block
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  NumPagesToWrite  number of pages to write to block
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_Page(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, void *pBuffer,
                                      uint32_t NumPagesToWrite)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t bufferOffset = 0;
  uint32_t nandAddressMax;
  uint32_t nandAddress;
  uint32_t numPagesWritten = 0;

  /* Process Locked */
  __HAL_LOCK(hnand);

  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* NAND raw address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    /* Page(s) write loop */
    while ((numPagesWritten < NumPagesToWrite) && (nandAddress < nandAddressMax))
    {
      /* Begin writing */
      HAL_NAND_WriteBegin(hnand, nandAddress, 0, NAND_AREA_USER);

      /* Write data to memory */
      HAL_NAND_WriteToDevice(hnand, hnand->Config.PageSize, pBuffer, bufferOffset);
      bufferOffset += hnand->Config.PageSize;

      /* End writing */
      status = HAL_NAND_WriteEnd(hnand);
      if (status != HAL_OK)
      {
        break;
      }

      /* Increment written pages number */
      numPagesWritten++;

      /* Increment the NAND address */
      nandAddress = (uint32_t)(nandAddress + 1U);
    }

    if (status == HAL_OK)
    {
      hnand->State = HAL_NAND_STATE_READY;
    }
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Write Page(s) to NAND memory block (8-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  NumPagesToWrite  number of pages to write to block
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, uint8_t *pBuffer,
                                         uint32_t NumPagesToWrite)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Write_Page(hnand, pAddress, pBuffer, NumPagesToWrite);
}

/**
  * @brief  Write Page(s) to NAND memory block (16-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write. pBuffer should be 16-bit aligned
  * @param  NumPagesToWrite   number of pages to write to block
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, uint16_t *pBuffer,
                                          uint32_t NumPagesToWrite)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Write_Page(hnand, pAddress, pBuffer, NumPagesToWrite);
}

/**
  * @brief  Write in a single page to NAND memory block
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  Offset  offset in the page
  * @param  Length  length to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_SinglePage(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, void *pBuffer,
                                            uint32_t Offset, uint32_t Length)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t nandAddressMax;
  uint32_t nandAddress;
  assert_param((Offset + Length) <= hnand->Config.PageSize);

  /* Process Locked */
  __HAL_LOCK(hnand);

  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

