zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
    /* NAND raw address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    /* Spare area(s) read loop */
    if (nandAddress < nandAddressMax)
    {
      /* Begin reading */
      status = HAL_NAND_ReadBegin(hnand, nandAddress, SPARE_AREA_COLUMN_ADDRESS(hnand) + Offset);
      if (status == HAL_OK)
      {
        /* Get data into Buffer */
        HAL_NAND_ReadFromDevice(hnand, Length, pBuffer, 0);
      }
    }

    if (status == HAL_OK)
    {
      hnand->State = HAL_NAND_STATE_READY;
    }
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Read in a single spare area from NAND memory block (8-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer pointer to source buffer to write
  * @param  Offset  offset in the page
  * @param  Length  length to read
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Read_SingleSpareArea_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                   uint8_t *pBuffer, uint32_t Offset, uint32_t Length)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Read_SingleSpareArea(hnand, pAddress, pBuffer, Offset, Length);
}

/**
  * @brief  Read in a single spare area from NAND memory block (16-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer pointer to source buffer to write. pBuffer should be 16-bit aligned.
  * @param  Offset  offset in the page
  * @param  Length  length to read
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Read_SingleSpareArea_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                    uint16_t *pBuffer, uint32_t Offset, uint32_t Length)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Read_SingleSpareArea(hnand, pAddress, pBuffer, Offset, Length);
}

/**
  * @brief  Write Spare area(s) to NAND memory
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  NumSpareAreasTowrite   number of spare areas to write to block
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_SpareArea(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, void *pBuffer,
                                           uint32_t NumSpareAreasTowrite)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t bufferOffset = 0;
  uint32_t nandAddressMax;
  uint32_t nandAddress;
  uint32_t numSpareAreasWritten = 0;

  /* Process Locked */
  __HAL_LOCK(hnand);

  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* Page address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    /* Spare area(s) write loop */
    while ((numSpareAreasWritten < NumSpareAreasTowrite) && (nandAddress < nandAddressMax))
    {
      /* Begin writing */
      HAL_NAND_WriteBegin(hnand, nandAddress, SPARE_AREA_COLUMN_ADDRESS(hnand), NAND_AREA_SPARE);

      /* Write data to memory */
      HAL_NAND_WriteToDevice(hnand, hnand->Config.SpareAreaSize, pBuffer, bufferOffset);
      bufferOffset += hnand->Config.SpareAreaSize;

      /* End writing */
      status = HAL_NAND_WriteEnd(hnand);
      if (status != HAL_OK)
      {
        break;
      }

      /* Increment written spare areas number */
      numSpareAreasWritten++;

      /* Increment the NAND address */
      nandAddress = (uint32_t)(nandAddress + 1U);
    }

    if (status == HAL_OK)
    {
      hnand->State = HAL_NAND_STATE_READY;
    }
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Write Spare area(s) to NAND memory (8-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  NumSpareAreasTowrite   number of spare areas to write to block
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_SpareArea_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                              uint8_t *pBuffer, uint32_t NumSpareAreasTowrite)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Write_SpareArea(hnand, pAddress, pBuffer, NumSpareAreasTowrite);
}

/**
  * @brief  Write Spare area(s) to NAND memory (16-bit addressing)
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write. pBuffer should be 16-bit aligned.
  * @param  NumSpareAreasTowrite   number of spare areas to write to block
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_SpareArea_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                               uint16_t *pBuffer, uint32_t NumSpareAreasTowrite)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Write_SpareArea(hnand, pAddress, pBuffer, NumSpareAreasTowrite);
}

/**
  * @brief  Write in a single spare area to NAND memory block
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  Offset  offset in the page
  * @param  Length  length to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Write_SingleSpareArea(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                 void *pBuffer, uint32_t Offset, uint32_t Length)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t nandAddressMax;
  uint32_t nandAddress;
  assert_param((Offset + Length) <= hnand->Config.SpareAreaSize);

  /* Process Locked */
  __HAL_LOCK(hnand);

  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* Page address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    /* Spare area(s) write loop */
    if (nandAddress < nandAddressMax)
    {
      /* Begin writing */
      HAL_NAND_WriteBegin(hnand, nandAddress, SPARE_AREA_COLUMN_ADDRESS(hnand) + Offset, NAND_AREA_SPARE);

      /* Write data to memory */
      HAL_NAND_WriteToDevice(hnand, Length, pBuffer, 0);

