zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_READY;
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Sets dynamically the BCH mode.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  Mode Mode to use for the BCH ECC: FMC_NAND_BCH_4BIT or FMC_NAND_BCH_8BIT
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_ECC_SetBCHMode(NAND_HandleTypeDef *hnand, uint32_t Mode)
{
  HAL_StatusTypeDef status = HAL_OK;
  assert_param(IS_FMC_BCH_MODE(Mode));

  /* Process Locked */
  __HAL_LOCK(hnand);

  /* Check the NAND controller state */
  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* Sets the BCH mode */
    (void)FMC_NAND_ECC_SetBCHMode(hnand->Instance, Mode);
    hnand->Init.EccAlgorithm = Mode;

    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_READY;
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Sets dynamically the access mode.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  Mode Access mode to use for the ECC: FMC_NAND_ECC_ACCESS_MODE_READ or
                 FMC_NAND_ECC_ACCESS_MODE_WRITE
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_ECC_SetAccessMode(NAND_HandleTypeDef *hnand, uint32_t Mode)
{
  HAL_StatusTypeDef status = HAL_OK;
  assert_param(IS_FMC_ECC_ACCESS_MODE(Mode));

  /* Process Locked */
  __HAL_LOCK(hnand);

  /* Check the NAND controller state */
  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* Sets the ECC access mode */
    (void)FMC_NAND_ECC_SetAccessMode(hnand->Instance, Mode);
    hnand->Init.EccAccessMode = Mode;

    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_READY;
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Gets the BCH ECC value that was computed while writing.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  ECCval Pointer to ECC value
  * @param  Timeout Timeout wait value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_ECC_GetBCH(NAND_HandleTypeDef *hnand, uint32_t *ECCval, uint32_t Timeout)
{
  HAL_StatusTypeDef status;

  /* Process Locked */
  __HAL_LOCK(hnand);

  /* Check the NAND controller state */
  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* Sets the ECC algorithm */
    status = FMC_NAND_ECC_GetBCH(hnand->Instance, ECCval, Timeout);
    if (status != HAL_OK)
    {
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
    }

    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_READY;
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Gets the bit positions where an error occurred while reading.
  * After the call:
  * - If no error was found, ErrorCount is set to 0
  * - If too many errors were found (more than 4 or 8 depending of BCH configuration), ErrorCount is set to -1
  * - Otherwise ErrorCount is set to the number of errors found (up to 8),
  * and Positions if filled with the error positions
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  Positions Pointer to an array of up to 8 error positions
  * @param  ErrorCount Pointer to a value giving the number of errors
  * @param  Timeout Timeout wait value
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_ECC_GetErrorsBCH(NAND_HandleTypeDef *hnand, uint16_t *Positions, int32_t *ErrorCount,
                                            uint32_t Timeout)
{
  HAL_StatusTypeDef status;
  uint32_t BCHDSRx[5];

  /* Process Locked */
  __HAL_LOCK(hnand);

  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* Sets the ECC algorithm */
    status = FMC_NAND_ECC_GetBCHResult(hnand->Instance, BCHDSRx, Timeout);
    if (status == HAL_OK)
    {
      FMC_NAND_ECC_DecodeBCHResult(BCHDSRx, Positions, ErrorCount);
    }
    else
    {
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
    }

    /* Update the NAND state */
    hnand->State = HAL_NAND_STATE_READY;
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_ERROR;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @}
  */


/** @defgroup NAND_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions
  *
@verbatim
  ==============================================================================
                         ##### NAND State functions #####
  ==============================================================================
  [..]
    This subsection permits to get in run-time the status of the NAND controller
    and the data flow.

@endverbatim
  * @{
  */

/**
  * @brief  return the NAND state
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @retval HAL state
  */
HAL_NAND_StateTypeDef HAL_NAND_GetState(NAND_HandleTypeDef *hnand)
{
  return hnand->State;
}

/**
  * @brief  NAND memory read status
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @retval NAND status
  */
HAL_StatusTypeDef HAL_NAND_Read_Status(NAND_HandleTypeDef *hnand, uint32_t *NandStatus)
{
  /* Process Locked */
  __HAL_LOCK(hnand);

  *NandStatus = HAL_NAND_Read_Status_Internal(hnand);

