zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return HAL_OK;
}

/**
  * @}
  */


/** @defgroup NAND_Exported_Functions_Group5 Input and Output functions with error correction
  *  @brief   Peripheral State functions
  *
@verbatim
  ==============================================================================
                 ##### NAND Input and Output with ECC functions #####
  ==============================================================================
  [..]
    This subsection permits to get in run-time the status of the NAND controller
    and the data flow.

@endverbatim
  * @{
  */

#define ECC_LENGTH_FOR_BCH4 (7 * 8)
#define ECC_LENGTH_FOR_BCH8 (13 * 8)

/**
  * @brief  Perform NAND memory initialization sequence for ECC support
  * This function must be called after HAL_NAND_Init() only.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  Config pointer to ECC configuration structure
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_ECC_Init(NAND_HandleTypeDef *hnand, const NAND_EccConfigTypeDef *Config)
{
  uint32_t sectorSizeIndex = hnand->Init.EccSectorSize >> FMC_PCR_ECCSS_Pos;

  hnand->EccConfig = *Config;

  hnand->EccState.SectorSize = (uint16_t)(1 << (8 + sectorSizeIndex));

  if (hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_BCH)
  {
    if (hnand->Init.BCHMode == FMC_NAND_BCH_4BIT)
    {
      hnand->EccState.EccLength = ECC_LENGTH_FOR_BCH4;
    }
    else
    {
      hnand->EccState.EccLength = ECC_LENGTH_FOR_BCH8;
    }
  }
  else
  {
    hnand->EccState.EccLength = (uint8_t)(22 + (2 * sectorSizeIndex));
  }

  if (hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8)
  {
    hnand->EccState.EccSize = (uint8_t)((hnand->EccState.EccLength + 7u) >> 3);
  }
  else
  {
    hnand->EccState.SectorSize >>= 1;
    hnand->EccState.EccSize = (uint8_t)((hnand->EccState.EccLength + 15u) >> 4);
  }

  hnand->EccState.SectorCount = (uint8_t)(hnand->Config.PageSize / hnand->EccState.SectorSize);

  return HAL_OK;
}

/**
  * @brief  Perform NAND memory De-Initialization sequence for ECC support
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_ECC_DeInit(NAND_HandleTypeDef *hnand)
{
  UNUSED(hnand);
  return HAL_OK;
}

static void HAL_NAND_ECC_ResetErrorCounters(NAND_HandleTypeDef *hnand)
{
  hnand->EccStatistics.CorrectibleErrorTotal = 0;
  hnand->EccStatistics.CorrectibleErrorMax = 0;
  hnand->EccStatistics.CorrectibleSectorCount = 0;
  hnand->EccStatistics.BadSectorCount = 0;
}

static void HAL_NAND_ECC_UpdateErrorCounters(NAND_HandleTypeDef *hnand, int32_t ErrorCount)
{
  if (ErrorCount > 0)
  {
    hnand->EccStatistics.CorrectibleErrorTotal += (uint16_t)ErrorCount;
    if (hnand->EccStatistics.CorrectibleErrorMax < ErrorCount)
    {
      hnand->EccStatistics.CorrectibleErrorMax = ErrorCount;
    }
    hnand->EccStatistics.CorrectibleSectorCount++;
  }
  else if (ErrorCount < 0)
  {
    hnand->EccStatistics.BadSectorCount++;
  }
}
static void HAL_NAND_ECC_flipBit(NAND_HandleTypeDef *hnand, void *Data, uint32_t DataOffset, uint32_t BitPosition)
{
  uint32_t byte = BitPosition >> 3;
  uint32_t bit = BitPosition & 0x7u;
  uint8_t *data8 = (uint8_t *)Data + (hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8 ? DataOffset : DataOffset * 2U);
  data8[byte] ^= (1u << bit);
}

/**
  * @brief Correct the error (single bit) found by Hamming algorithm, if any.
  *
  * The length of the ECC (given in ecc_length) depends on the sector size:
  * - 256 bytes sector -> 22 bits ECC
  * - 512 bytes sector -> 24 bits ECC
  * - 1024 bytes sector -> 26 bits ECC
  * - 2048 bytes sector -> 28 bits ECC
  * - 4096 bytes sector -> 30 bits ECC
  * - 8192 bytes sector -> 32 bits ECC
  *
  * @param SectorData sector data
  * @param EccLength length of the ECC bits in both EccWhenWriting and EccWhenReading
  * @param EccWhenWriting ECC computed when writing
  * @param EccWhenReading ECC computed when reading
  * @retval 0 if no error was detected,
  *         1 if one error has been found and corrected,
  *        -1 if more than one error was detected (it cannot be corrected)
  */
static int32_t HAL_NAND_ECC_CorrectHamming(NAND_HandleTypeDef *hnand, void *SectorData, uint32_t SectorOffset,
                                           uint32_t EccLength, uint32_t EccWhenWriting, uint32_t EccWhenReading)
{
  uint32_t length = EccLength;
  uint32_t bitPosition;
  uint32_t shifting;
  uint32_t xoredEcc;

  /* Indicate which bit and byte is faulty (if any) */
  xoredEcc = EccWhenWriting ^ EccWhenReading;
  if (xoredEcc == 0)
  {
    /* No error */
    return 0;
  }

  /* Calculate bit position */
  bitPosition = 0;
  shifting = 1;
  do
  {
    switch (xoredEcc % 4u)
    {
      default:
        return -1;
      case 2:
        bitPosition += shifting;
        break;
      case 1:
        break;
    }
    shifting <<= 1;
    xoredEcc >>= 2;
    length -= 2u;
  } while (length > 0u);

  /* Flip the bit */
  HAL_NAND_ECC_flipBit(hnand, SectorData, SectorOffset, bitPosition);

  return 1;
}

/**
  * @brief Correct the errors found by BCH algorithm, if any.
  *
  * @param SectorData sector data
  * @param ErrorCount number of errors found (up to 8)
  * @param Positions position of each error (bit index in the sector)
  * @retval 0 if no error was detected,
  *         1 if one error has been found and corrected,
  *         -1 if more than one error was detected (it cannot be corrected)
  */
static void HAL_NAND_ECC_CorrectBCH(NAND_HandleTypeDef *hnand, void *SectorData, uint32_t SectorOffset,
                                    int32_t ErrorCount, const uint16_t *Positions)
{
  int32_t errorIndex;
  uint32_t bitPosition;
  uint32_t sectorSizeInBits = hnand->EccState.SectorSize * (hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8 ? \
                                                            8U : 16U); /* Sector size in bits */
  for (errorIndex = 0; errorIndex < ErrorCount; errorIndex++)
  {
    bitPosition = Positions[errorIndex];
    if (bitPosition < sectorSizeInBits)
    {
      /* Flip the bit */
      HAL_NAND_ECC_flipBit(hnand, SectorData, SectorOffset, bitPosition);
    }
  }
}

static HAL_StatusTypeDef HAL_NAND_ECC_Read_Sector(NAND_HandleTypeDef *hnand, uint32_t SectorOffset, uint32_t EccOffset,
                                                  void *Buff, uint32_t BuffOffset)
{
  HAL_StatusTypeDef status;
  uint32_t eccWhenWriting[4] = {0x00U};
  uint32_t eccWhenReading[4] = {0x00U};
  uint32_t BCHDSRx[5]        = {0x00U};
  uint16_t errorPositions[8] = {0x00U};
  int32_t errorCount = 0;

  /* Change read position (column) to sector data */
  HAL_NAND_ChangeReadColumn(hnand, SectorOffset);

  /* Read the NAND page sector */
  HAL_NAND_ReadFromDevice(hnand, hnand->EccState.SectorSize, Buff, BuffOffset);

  /* Change read position (column) to ECC data */
  HAL_NAND_ChangeReadColumn(hnand, EccOffset);

  /* Read the corresponding ECC (automatically copied in registers for BCH) */
  HAL_NAND_ReadFromDevice(hnand, hnand->EccState.EccSize, eccWhenWriting, 0);

  /* The ECC is automatically computed by hardware, now try to correct errors if any */
  if (hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_BCH)
  {
    /* For BCH, the read ECC and the computed ECC are automatically used to compute error positions */
    status = FMC_NAND_ECC_GetBCHResult(hnand->Instance, BCHDSRx, hnand->TimeOut);
    if (status == HAL_OK)
    {
      FMC_NAND_ECC_DecodeBCHResult(BCHDSRx, errorPositions, &errorCount);
      HAL_NAND_ECC_CorrectBCH(hnand, Buff, BuffOffset, errorCount, errorPositions);
    }
    else
    {
      hnand->State = HAL_NAND_STATE_ERROR;
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
    }
  }
  else
  {
    /* For Hamming, we must retrieve the computed ECC and find ourselves the error position */
    status = FMC_NAND_GetECC(hnand->Instance, eccWhenReading, hnand->Init.NandBank, hnand->TimeOut);
    if (status == HAL_OK)
    {
      errorCount = HAL_NAND_ECC_CorrectHamming(hnand, Buff, BuffOffset, hnand->EccState.EccLength,
                                               eccWhenWriting[0], eccWhenReading[0]);
    }
    else
    {
      hnand->State = HAL_NAND_STATE_ERROR;
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
    }
  }

  if (status == HAL_OK)
  {
    HAL_NAND_ECC_UpdateErrorCounters(hnand, errorCount);
  }

