zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
  return status;
}

static HAL_StatusTypeDef HAL_NAND_ECC_Read_SinglePage(NAND_HandleTypeDef *hnand, uint32_t NandAddress, void *Buff,
                                                      uint32_t BuffOffset)
{
  HAL_StatusTypeDef status;
  uint32_t sectorOffset;
  uint32_t eccOffset;

  HAL_NAND_ECC_ResetErrorCounters(hnand);

  sectorOffset = 0;
  eccOffset = hnand->Config.PageSize + hnand->EccConfig.Offset;

  /* Begin reading */
  status = HAL_NAND_ReadBegin(hnand, NandAddress, 0);
  if (status == HAL_OK)
  {
    do
    {
      /* Enable ECC computations */
      (void)FMC_NAND_ECC_Enable(hnand->Instance, hnand->Init.NandBank);
      /* Read sector */
      status = HAL_NAND_ECC_Read_Sector(hnand, sectorOffset, eccOffset, Buff, BuffOffset + sectorOffset);
      /* Reset ECC computations */
      (void)FMC_NAND_ECC_Disable(hnand->Instance, hnand->Init.NandBank);
      if (status != HAL_OK)
      {
        break;
      }

      sectorOffset += hnand->EccState.SectorSize;
      eccOffset += hnand->EccState.EccSize;
    } while (sectorOffset < hnand->Config.PageSize);
  }

  return status;
}

/**
  * @brief  Read Page(s) from NAND memory block with error correction
  * If no error occurred, HAL_OK is returned and NumPagesRead is equal to NumPagesToRead.
  * If read errors cannot be corrected with ECC, HAL_OK is returned and NumPagesRead indicates
  *   the index of the concerned page.
  * If a non-ECC error occurred, a value different of HAL_OK is returned and NumPagesRead indicates
  *   the index of the concerned page.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @param  NumPageToRead  number of pages to read
  * @param  NumPageRead  number of pages effectively read
  * @retval HAL status
  */
static HAL_StatusTypeDef HAL_NAND_ECC_Read_Page(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, void *pBuffer,
                                                uint32_t NumPagesToRead, uint32_t *NumPagesRead)
{
  HAL_StatusTypeDef status;
  uint32_t bufferOffset = 0;
  uint32_t nandAddressMax;
  uint32_t nandAddress;
  uint32_t numPagesRead = 0U;

  /* Process Locked */
  __HAL_LOCK(hnand);

  /* Check the NAND controller state */
  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* NAND raw address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    /* Reset ECC computations */
    (void)FMC_NAND_ECC_Disable(hnand->Instance, hnand->Init.NandBank);

    /* Set read mode for ECC computation */
    if (hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_BCH)
    {
      (void)FMC_NAND_ECC_SetAccessMode(hnand->Instance, FMC_NAND_ECC_ACCESS_MODE_READ);
    }

    /* Page read loop */
    while ((numPagesRead < NumPagesToRead) && (nandAddress < nandAddressMax))
    {
      status = HAL_NAND_ECC_Read_SinglePage(hnand, nandAddress, pBuffer, bufferOffset);
      if (status != HAL_OK)
      {
        hnand->State = HAL_NAND_STATE_ERROR;
        break;
      }

      if ((status != HAL_OK) || (hnand->EccStatistics.BadSectorCount > 0))
      {
        break;
      }

      /* Next page in the destination buffer */
      bufferOffset += hnand->Config.PageSize;

      /* Increment read pages number */
      numPagesRead++;

      /* Increment the NAND address */
      nandAddress = (uint32_t)(nandAddress + 1U);
    }

    *NumPagesRead = numPagesRead;

    if (status == HAL_OK)
    {
      /* Update the NAND controller state */
      hnand->State = HAL_NAND_STATE_READY;
    }
  }
  else
  {
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Read Page(s) from NAND memory block with error correction (8-bit addressing)
  * If no error occurred, HAL_OK is returned and NumPagesRead is equal to NumPagesToRead.
  * If read errors cannot be corrected with ECC, HAL_OK is returned and NumPagesRead indicates
  *   the index of the concerned page.
  * If a non-ECC error occurred, a value different of HAL_OK is returned and NumPagesRead indicates
  *   the index of the concerned page.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @param  NumPageToRead  number of pages to read
  * @param  NumPageRead  number of pages effectively read
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_ECC_Read_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, uint8_t *pBuffer,
                                             uint32_t NumPagesToRead, uint32_t *NumPagesRead)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_ECC_Read_Page(hnand, pAddress, pBuffer, NumPagesToRead, NumPagesRead);
}

/**
  * @brief  Read Page(s) from NAND memory block with error correction (16-bit addressing)
  * If no error occurred, HAL_OK is returned and NumPagesRead is equal to NumPagesToRead.
  * If read errors cannot be corrected with ECC, HAL_OK is returned and NumPagesRead indicates
  *   the index of the concerned page.
  * If a non-ECC error occurred, a value different of HAL_OK is returned and NumPagesRead indicates
  *   the index of the concerned page.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @param  NumPageToRead  number of pages to read
  * @param  NumPageRead  number of pages effectively read
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_ECC_Read_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                              uint16_t *pBuffer, uint32_t NumPagesToRead, uint32_t *NumPagesRead)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_ECC_Read_Page(hnand, pAddress, pBuffer, NumPagesToRead, NumPagesRead);
}

static HAL_StatusTypeDef HAL_NAND_ECC_Write_Sector(NAND_HandleTypeDef *hnand, uint32_t SectorOffset, uint32_t EccOffset,
                                                   void *Buff, uint32_t BuffOffset)
{
  HAL_StatusTypeDef status;
  uint32_t EccWhenWriting[4];

  /* Change write position (column) to sector data */
  HAL_NAND_ChangeWriteColumn(hnand, SectorOffset);

  /* Write the NAND sector */
  HAL_NAND_WriteToDevice(hnand, hnand->EccState.SectorSize, Buff, BuffOffset);

  if (hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_BCH)
  {
    status = FMC_NAND_ECC_GetBCH(hnand->Instance, EccWhenWriting, hnand->TimeOut);
  }
  else
  {
    status = FMC_NAND_GetECC(hnand->Instance, EccWhenWriting, hnand->Init.NandBank, hnand->TimeOut);
  }
  if (status == HAL_OK)
  {
    /* Change write position (column) to ECC data */
    HAL_NAND_ChangeWriteColumn(hnand, EccOffset);

