zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
    /* Write the corresponding ECC */
    HAL_NAND_WriteToDevice(hnand, hnand->EccState.EccSize, EccWhenWriting, 0);
  }
  else
  {
    hnand->State = HAL_NAND_STATE_ERROR;
    hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
  }

  return status;
}

static HAL_StatusTypeDef HAL_NAND_ECC_Write_SinglePage(NAND_HandleTypeDef *hnand, uint32_t NandAddress, void *Buff,
                                                       uint32_t BuffOffset)
{
  HAL_StatusTypeDef status;
  uint32_t sectorOffset;
  uint32_t eccOffset;

  HAL_NAND_ECC_ResetErrorCounters(hnand);

  sectorOffset = 0;
  eccOffset = hnand->Config.PageSize + hnand->EccConfig.Offset;

  /* Begin writing */
  HAL_NAND_WriteBegin(hnand, NandAddress, 0, NAND_AREA_USER);

  do
  {
    /* Enable ECC computations */
    (void)FMC_NAND_ECC_Enable(hnand->Instance, hnand->Init.NandBank);
    /* Write sector */
    status = HAL_NAND_ECC_Write_Sector(hnand, sectorOffset, eccOffset, Buff, BuffOffset + sectorOffset);
    /* Reset ECC computations */
    (void)FMC_NAND_ECC_Disable(hnand->Instance, hnand->Init.NandBank);
    if (status != HAL_OK)
    {
      return status;
    }

    sectorOffset += hnand->EccState.SectorSize;
    eccOffset += hnand->EccState.EccSize;
  } while (sectorOffset < hnand->Config.PageSize);

  status = HAL_NAND_WriteEnd(hnand);

  return status;
}

/**
  * @brief  Write Page(s) to NAND memory block with error correction
  * If no error occurred, HAL_OK is returned and NumPagesWritten is equal to NumPagesToWrite.
  * If an error occurred, a value different of HAL_OK is returned and NumPagesWritten indicates
  *   the index of the concerned page.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  NumPagesToWrite  number of pages to write to block
  * @param  NumPagesWritten  number of pages effectively written
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_ECC_Write_Page(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress, void *pBuffer,
                                           uint32_t NumPagesToWrite, uint32_t *NumPagesWritten)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t nandAddressMax;
  uint32_t nandAddress;
  uint32_t numPagesWritten = 0U;
  uint32_t bufferOffset = 0;

  /* Process Locked */
  __HAL_LOCK(hnand);

  /* Check the NAND controller state */
  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    /* NAND raw address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    /* Reset ECC computations */
    (void)FMC_NAND_ECC_Disable(hnand->Instance, hnand->Init.NandBank);

    /* Set write mode for ECC computation */
    if (hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_BCH)
    {
      (void)FMC_NAND_ECC_SetAccessMode(hnand->Instance, FMC_NAND_ECC_ACCESS_MODE_WRITE);
    }

    /* Page(s) write loop */
    while ((numPagesWritten < NumPagesToWrite) && (nandAddress < nandAddressMax))
    {
      status = HAL_NAND_ECC_Write_SinglePage(hnand, nandAddress, pBuffer, bufferOffset);
      if (status != HAL_OK)
      {
        break;
      }

      /* Next page in the destination buffer */
      bufferOffset += hnand->Config.PageSize;

      /* Increment written pages number */
      numPagesWritten++;

      /* Increment the NAND address */
      nandAddress = (uint32_t)(nandAddress + 1U);
    }

    *NumPagesWritten = numPagesWritten;

    /* Update the NAND controller state */
    if (status == HAL_OK)
    {
      hnand->State = HAL_NAND_STATE_READY;
    }
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    status = HAL_BUSY;
  }

  /* Process unlocked */
  __HAL_UNLOCK(hnand);

  return status;
}

/**
  * @brief  Write Page(s) to NAND memory with error correction
  * If no error occurred, HAL_OK is returned and NumPagesWritten is equal to NumPagesToWrite.
  * If an error occurred, a value different of HAL_OK is returned and NumPagesWritten indicates
  *   the index of the concerned page.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  NumPagesToWrite  number of pages to write to block
  * @param  NumPagesWritten  number of pages effectively written
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_ECC_Write_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                              uint8_t *pBuffer,
                                              uint32_t NumPagesToWrite, uint32_t *NumPagesWritten)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_ECC_Write_Page(hnand, pAddress, pBuffer, NumPagesToWrite, NumPagesWritten);
}

/**
  * @brief  Write Page(s) to NAND memory with error correction
  * If no error occurred, HAL_OK is returned and NumPagesWritten is equal to NumPagesToWrite.
  * If an error occurred, a value different of HAL_OK is returned and NumPagesWritten indicates
  *   the index of the concerned page.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @param  NumPagesToWrite  number of pages to write to block
  * @param  NumPagesWritten  number of pages effectively written
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_ECC_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                               uint16_t *pBuffer,
                                               uint32_t NumPagesToWrite, uint32_t *NumPagesWritten)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_ECC_Write_Page(hnand, pAddress, pBuffer, NumPagesToWrite, NumPagesWritten);
}

/**
  * @brief  Get the ECC statistics about the page read
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *               the configuration information for NAND module.
  * @param  Stat  pointer to ECC statistics structure
  */
void HAL_NAND_ECC_GetStatistics(NAND_HandleTypeDef *hnand, NAND_EccStatisticsTypeDef *Stat)
{
  *Stat = hnand->EccStatistics;
}

/**
  * @}
  */



/** @defgroup NAND_Exported_Functions_Group6 Input and Output functions with error correction
  *  @brief   Peripheral State functions
  *
@verbatim
  ==============================================================================
                 ##### NAND Input and Output with sequencer functions #####
  ==============================================================================
  [..]

@endverbatim
  * @{
  */

