zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
#ifdef HAL_MDMA_MODULE_ENABLED

/**
  * @brief  Compute the number of 32-bit words needed by the sequencer to store the ECC of a sector
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *               the configuration information for NAND module.
  * @retval Number of words needed to store ECC for a sector
  */
uint32_t HAL_NAND_Sequencer_GetEccWordsPerSector(NAND_HandleTypeDef *hnand)
{
  return hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_HAMMING ? 1 : 5; /* HECCR or BCHDSR0 to BCHDSR4 */
}

/**
  * @brief  Compute the size of the buffer needed by the sequencer to store the ECC of a page
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @retval Size of the buffer needed to store ECC for a page
  */
uint32_t HAL_NAND_Sequencer_ComputeEccBufferSize(NAND_HandleTypeDef *hnand)
{
  uint32_t wordsPerSector = HAL_NAND_Sequencer_GetEccWordsPerSector(hnand);
  return hnand->EccState.SectorCount * wordsPerSector * 4;
}

/**
  * @brief  Perform NAND memory initialization sequence for sequencer support
  * This function must be called after HAL_NAND_ECC_Init() only.
  * This function calls the weak function HAL_NAND_Sequencer_MspInit() which allows to setup the 3 DMA channels.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  Config pointer to sequencer configuration structure
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_Init(NAND_HandleTypeDef *hnand, const NAND_SequencerConfigTypeDef *Config)
{
  hnand->SequencerConfig = *Config;
  hnand->SequencerState.EccBufferSize = HAL_NAND_Sequencer_ComputeEccBufferSize(hnand);
  hnand->SequencerState.TransferPending = false;
  return HAL_NAND_Sequencer_MspInit(hnand);
}

/**
  * @brief  Perform NAND memory De-Initialization sequence for sequencer support
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_DeInit(NAND_HandleTypeDef *hnand)
{
  HAL_NAND_Sequencer_MspDeInit(hnand);
  hnand->SequencerConfig.HdmaRead = NULL;
  hnand->SequencerConfig.HdmaWrite = NULL;
  hnand->SequencerConfig.HdmaReadEcc = NULL;
  hnand->SequencerConfig.EccBuffer = NULL;
  hnand->SequencerState.EccBufferSize = 0;
  hnand->SequencerState.TransferPending = false;
  return HAL_OK;
}

/**
  * @brief  Initialize the NAND sequencer MSP.
  * @param  hnand: NAND handle.
  * @retval None
  */
__weak HAL_StatusTypeDef HAL_NAND_Sequencer_MspInit(NAND_HandleTypeDef *hnand)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hnand);

  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_NAND_Sequencer_MspInit() can be implemented in the user file.
   */
  return HAL_OK;
}

/**
  * @brief  DeInitialize the NAND sequencer MSP.
  * @param  hnand: NAND handle.
  * @retval None
  */
__weak void HAL_NAND_Sequencer_MspDeInit(NAND_HandleTypeDef *hnand)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(hnand);

  /* NOTE : This function should not be modified; when the callback is needed,
            HAL_NAND_Sequencer_MspDeInit() can be implemented in the user file.
   */
}

static void HAL_NAND_Sequencer_setup(NAND_HandleTypeDef *hnand, uint32_t NandAddress, bool WriteFlag, bool RawFlag)
{
  uint32_t csqcfr1;
  uint32_t csqcfr2;
  uint32_t csqcfr3;
  uint32_t csqar1;
  uint32_t csqar2;
  uint32_t totalPageNumber = hnand->Config.BlockSize * hnand->Config.BlockNbr;
  bool attUsed = true;

  /* Reset ECC computations */
  (void)FMC_NAND_ECC_Disable(hnand->Instance, hnand->Init.NandBank);

  /* Set read or write mode for ECC computation */
  (void)FMC_NAND_ECC_SetAccessMode(hnand->Instance, WriteFlag ? FMC_NAND_ECC_ACCESS_MODE_WRITE :
                                   FMC_NAND_ECC_ACCESS_MODE_READ);

  /*
   * - Set Program Page/Page Read command
   * - Enable DMA request data
   * - Set timings
   */
  csqcfr1 = FMC_CSQCFGR1_DMADEN;
  if (attUsed)
  {
    csqcfr1 |= FMC_CSQCFGR1_CMD1T;
  }
  if (WriteFlag)
  {
    csqcfr1 |= NAND_CMD_WRITE0 << FMC_CSQCFGR1_CMD1_Pos;
  }
  else
  {
    csqcfr1 |=
      (NAND_CMD_AREA_A << FMC_CSQCFGR1_CMD1_Pos) |
      FMC_CSQCFGR1_CMD2EN |
      (NAND_CMD_AREA_TRUE1 << FMC_CSQCFGR1_CMD2_Pos);
    if (attUsed)
    {
      csqcfr1 |= FMC_CSQCFGR1_CMD2T;
    }
  }

  /*
   * - Set Random Data Input/Random Data Read command
   * - Enable the sequencer to access the Spare data area
   * - Enable  DMA request status decoding for read
   * - Set timings
   */
  if (WriteFlag)
  {
    csqcfr2 = NAND_CMD_RANDOM_INPUT << FMC_CSQCFGR2_RCMD1_Pos;
  }
  else
  {
    csqcfr2 =
      (NAND_CMD_RANDOM_OUTPUT_0 << FMC_CSQCFGR2_RCMD1_Pos) |
      FMC_CSQCFGR2_RCMD2EN |
      (NAND_CMD_RANDOM_OUTPUT_1 << FMC_CSQCFGR2_RCMD2_Pos);
    if (attUsed)
    {
      csqcfr2 |= FMC_CSQCFGR2_RCMD1T | FMC_CSQCFGR2_RCMD2T;
    }
  }
  if (!RawFlag)
  {
    if (!WriteFlag)
    {
      csqcfr2 |= FMC_CSQCFGR2_DMASEN;
    }
    csqcfr2 |= FMC_CSQCFGR2_SQSDTEN;
  }

  /*
   * - Set the number of sectors to be written
   * - Set timings
   */
  csqcfr3 = (hnand->EccState.SectorCount - 1) << FMC_CSQCFGR3_SNBR_Pos;
  if (WriteFlag && attUsed)
  {
    csqcfr3 |= FMC_CSQCFGR3_RAC2T;
    if (totalPageNumber > NAND_MAX_PAGES_FOR_16BIT_ADDRESS)
    {
      csqcfr3 |= FMC_CSQCFGR3_AC5T;
    }
    else
    {
      csqcfr3 |= FMC_CSQCFGR3_AC4T;
    }
  }

  /*
   * Set the fourth first address cycles
   * Byte 1 and byte 2 => column, we start at 0x0
   * Byte 3 and byte 4 => page
   */
  csqar1 = NandAddress << FMC_CSQAR1_ADDC3_Pos;

  /*
   * - Set chip enable number
   * - Set ECC byte offset in the spare area
   * - Calculate the number of address cycles to be issued
   * - Set byte 5 of address cycle if needed
   */

  csqar2 = hnand->ChipSelect == NAND_NCE1_OFFSET ? FMC_CSQAR2_NANDCEN_0 : FMC_CSQAR2_NANDCEN_1;
  csqar2 |= (hnand->Config.PageSize + hnand->EccConfig.Offset) << FMC_CSQAR2_SAO_Pos;
  if (totalPageNumber > NAND_MAX_PAGES_FOR_16BIT_ADDRESS)
  {
    csqcfr1 |= 5 << FMC_CSQCFGR1_ACYNBR_Pos;
    csqar2 |= ((NandAddress >> 16) & 0xff) << FMC_CSQAR2_ADDC5_Pos;
  }
  else
  {
    csqcfr1 |= 4 << FMC_CSQCFGR1_ACYNBR_Pos;
  }

  MODIFY_REG(hnand->Instance->CSQCFGR1, FMC_CSQCFGR1_CMD2EN_Msk | FMC_CSQCFGR1_DMADEN_Msk | FMC_CSQCFGR1_ACYNBR_Msk |
             FMC_CSQCFGR1_CMD1_Msk | FMC_CSQCFGR1_CMD2_Msk | FMC_CSQCFGR1_CMD1T_Msk |
             FMC_CSQCFGR1_CMD2T_Msk, csqcfr1);
  MODIFY_REG(hnand->Instance->CSQCFGR2, FMC_CSQCFGR2_SQSDTEN_Msk | FMC_CSQCFGR2_RCMD2EN_Msk | FMC_CSQCFGR2_DMASEN_Msk |
             FMC_CSQCFGR2_RCMD1_Msk | FMC_CSQCFGR2_RCMD2_Msk | FMC_CSQCFGR2_RCMD1T_Msk |
             FMC_CSQCFGR2_RCMD2T_Msk, csqcfr2);
  MODIFY_REG(hnand->Instance->CSQCFGR3, FMC_CSQCFGR3_SNBR_Msk | FMC_CSQCFGR3_AC1T_Msk | FMC_CSQCFGR3_AC2T_Msk |
             FMC_CSQCFGR3_AC3T_Msk | FMC_CSQCFGR3_AC4T_Msk | FMC_CSQCFGR3_AC5T_Msk |
             FMC_CSQCFGR3_SDT_Msk | FMC_CSQCFGR3_RAC1T_Msk | FMC_CSQCFGR3_RAC2T_Msk,
             csqcfr3);
  MODIFY_REG(hnand->Instance->CSQAR1, FMC_CSQAR1_ADDC1_Msk | FMC_CSQAR1_ADDC2_Msk | FMC_CSQAR1_ADDC3_Msk |
             FMC_CSQAR1_ADDC4_Msk, csqar1);
  MODIFY_REG(hnand->Instance->CSQAR2, FMC_CSQAR2_ADDC5_Msk | FMC_CSQAR2_NANDCEN_Msk | FMC_CSQAR2_SAO_Msk, csqar2);
}

