zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
#define HAL_NAND_SEQUENCER_TIMEOUT 5000

HAL_StatusTypeDef HAL_NAND_Sequencer_Abort(NAND_HandleTypeDef *hnand)
{
  HAL_StatusTypeDef status;

  if (hnand->State == HAL_NAND_STATE_BUSY)
  {
    /* FIXME: No information has been found on how to abort the sequencer.
       But the word 'abort' is evoked in 22.9.8 and for "TCF: Transfer Complete flag". */

    if (HAL_MDMA_GetState(hnand->SequencerConfig.HdmaRead) == HAL_MDMA_STATE_BUSY)
    {
      status = HAL_MDMA_Abort(hnand->SequencerConfig.HdmaRead);
      if (status != HAL_OK)
      {
        hnand->State = HAL_NAND_STATE_ERROR;
        hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
        __HAL_UNLOCK(hnand);
        return HAL_ERROR;
      }
    }

    if (HAL_MDMA_GetState(hnand->SequencerConfig.HdmaWrite) == HAL_MDMA_STATE_BUSY)
    {
      status = HAL_MDMA_Abort(hnand->SequencerConfig.HdmaWrite);
      if (status != HAL_OK)
      {
        hnand->State = HAL_NAND_STATE_ERROR;
        hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
        __HAL_UNLOCK(hnand);
        return HAL_ERROR;
      }
    }

    if (HAL_MDMA_GetState(hnand->SequencerConfig.HdmaReadEcc) == HAL_MDMA_STATE_BUSY)
    {
      status = HAL_MDMA_Abort(hnand->SequencerConfig.HdmaReadEcc);
      if (status != HAL_OK)
      {
        hnand->State = HAL_NAND_STATE_ERROR;
        hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
        __HAL_UNLOCK(hnand);
        return HAL_ERROR;
      }
    }

    hnand->State = HAL_NAND_STATE_READY;
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;
    hnand->SequencerState.TransferPending = false;
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_NO_XFER;
    status = HAL_ERROR;
  }

  __HAL_UNLOCK(hnand);

  return status;
}

static HAL_StatusTypeDef HAL_NAND_Sequencer_WaitTransferCompletion(NAND_HandleTypeDef *hnand, uint32_t TimeOut)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t tickstart;

  /* Read status until NAND is ready */
  tickstart = HAL_GetTick();
  while (!READ_BIT(hnand->Instance->CSQISR, FMC_CSQISR_TCF))
  {
    if ((TimeOut != HAL_MAX_DELAY) && ((TimeOut == 0U) || ((HAL_GetTick() - tickstart) > TimeOut)))
    {
      /* If timeout then abort the current transfer. No need to check return value: as in this case we will return
         HAL_ERROR with HAL_MDMA_ERROR_TIMEOUT error code */
      (void)HAL_NAND_Sequencer_Abort(hnand);

      hnand->State = HAL_NAND_STATE_ERROR;
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
      status = HAL_ERROR;
      break;
    }
  }

  return status;
}

static uint32_t HAL_NAND_ECC_ReadHamming(uint32_t EccSize, const uint8_t *Buffer)
{
  uint32_t ecc = 0;
  uint32_t i;
  for (i = 0; i < EccSize; i++)
  {
    ecc = (ecc << 8) | Buffer[i];
  }
  return ecc;
}

static void HAL_NAND_Sequencer_Correct(NAND_HandleTypeDef *hnand)
{
  uint32_t sectorMap = hnand->Instance->CSQEMSR & FMC_CSQEMSR_SEM_Msk;
  if (sectorMap)
  {
    uint32_t sectorCount = hnand->EccState.SectorCount, sectorIndex;
    uint32_t eccSize = hnand->EccState.EccSize;
    uint32_t eccTotalSize = eccSize * sectorCount;
    uint8_t eccWhenWritingBuffer[eccTotalSize];

    /* Change read position (column) to ECC data */
    HAL_NAND_ChangeReadColumn(hnand, hnand->Config.PageSize + hnand->EccConfig.Offset);

    /* Read the corresponding ECC (automatically copied in registers for BCH) */
    HAL_NAND_ReadFromDevice(hnand, eccTotalSize, eccWhenWritingBuffer, 0);

    for (sectorIndex = 0; sectorIndex < sectorCount; sectorIndex++)
    {
      if (sectorMap & (1 << sectorIndex))
      {
        uint32_t dataOffset = sectorIndex * hnand->EccState.SectorSize;
        int32_t errorCount;
        if (hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_HAMMING)
        {
          uint32_t eccWhenWriting = HAL_NAND_ECC_ReadHamming(eccSize, &eccWhenWritingBuffer[sectorIndex * eccSize]);
          uint32_t eccWhenReading = hnand->SequencerConfig.EccBuffer[sectorIndex];
          errorCount = HAL_NAND_ECC_CorrectHamming(hnand, hnand->SequencerState.Data, dataOffset,
                                                   hnand->EccState.EccLength, eccWhenWriting, eccWhenReading);
        }
        else
        {
          uint32_t *BCHDSRx = &hnand->SequencerConfig.EccBuffer[sectorIndex * 5];
          uint16_t errorPositions[8];
          FMC_NAND_ECC_DecodeBCHResult(BCHDSRx, errorPositions, &errorCount);
          HAL_NAND_ECC_CorrectBCH(hnand, hnand->SequencerState.Data, dataOffset, errorCount, errorPositions);
        }
        HAL_NAND_ECC_UpdateErrorCounters(hnand, errorCount);
      }
    }
  }
}

HAL_StatusTypeDef HAL_NAND_Sequencer_WaitCompletion(NAND_HandleTypeDef *hnand, uint32_t TimeOut)
{
  HAL_StatusTypeDef status;

  if (hnand->State == HAL_NAND_STATE_BUSY)
  {
    assert(hnand->SequencerState.TransferPending);

    /* Wait sequencer completion. */
    status = HAL_NAND_Sequencer_WaitTransferCompletion(hnand, TimeOut);
    if (status != HAL_OK)
    {
      __HAL_UNLOCK(hnand);
      return status;
    }

    /* Wait DMA read data transfer completion. */
    status = HAL_MDMA_PollForTransfer(hnand->SequencerConfig.HdmaRead, HAL_MDMA_FULL_TRANSFER, TimeOut);
    if (status != HAL_OK && hnand->SequencerConfig.HdmaRead->ErrorCode != HAL_MDMA_ERROR_NO_XFER)
    {
      hnand->State = HAL_NAND_STATE_ERROR;
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
      __HAL_UNLOCK(hnand);
      return status;
    }

    /* Wait DMA write data transfer completion. */
    status = HAL_MDMA_PollForTransfer(hnand->SequencerConfig.HdmaWrite, HAL_MDMA_FULL_TRANSFER, TimeOut);
    if (status != HAL_OK && hnand->SequencerConfig.HdmaWrite->ErrorCode != HAL_MDMA_ERROR_NO_XFER)
    {
      hnand->State = HAL_NAND_STATE_ERROR;
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
      __HAL_UNLOCK(hnand);
      return status;
    }

    /* Wait DMA ECC transfer completion. */
    status = HAL_MDMA_PollForTransfer(hnand->SequencerConfig.HdmaReadEcc, HAL_MDMA_FULL_TRANSFER, TimeOut);
    if (status != HAL_OK && hnand->SequencerConfig.HdmaReadEcc->ErrorCode != HAL_MDMA_ERROR_NO_XFER)
    {
      hnand->State = HAL_NAND_STATE_ERROR;
      hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
      __HAL_UNLOCK(hnand);
      return status;
    }

    if (!hnand->SequencerState.WriteFlag && !hnand->SequencerState.RawFlag)
    {
      HAL_NAND_Sequencer_Correct(hnand);
    }
    hnand->SequencerState.TransferPending = false;

    if (hnand->SequencerState.WriteFlag)
    {
      status = HAL_NAND_WriteEnd(hnand);
      if (status != HAL_OK)
      {
        hnand->State = HAL_NAND_STATE_ERROR;
        hnand->ErrorCode = HAL_NAND_ERROR_TIMEOUT;
        __HAL_UNLOCK(hnand);
        return status;
      }
    }

    status = HAL_OK;
    hnand->State = HAL_NAND_STATE_READY;
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_NO_XFER;
    status = HAL_ERROR;
  }

  __HAL_UNLOCK(hnand);

