zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_nand.c
  return status;
}

static HAL_StatusTypeDef HAL_NAND_Sequencer_startTransfer(NAND_HandleTypeDef *hnand, void *Buffer, bool WriteFlag,
                                                          bool RawFlag)
{
  HAL_StatusTypeDef status;
  MDMA_HandleTypeDef *hdmaData;
  MDMA_HandleTypeDef *hdmaEcc = NULL;
  uint32_t srcAddress;
  uint32_t dstAddress;
  uint32_t size;

  /* Configure DMA channel for reading or writing data. */
  if (WriteFlag)
  {
    hdmaData = hnand->SequencerConfig.HdmaWrite;
    srcAddress = (uint32_t)Buffer;
    dstAddress = hnand->DeviceAddress;
  }
  else
  {
    hdmaData = hnand->SequencerConfig.HdmaRead;
    srcAddress = hnand->DeviceAddress;
    dstAddress = (uint32_t)Buffer;
  }
  size = HAL_NAND_ComputeWordsToBytes(hnand->EccState.SectorSize, hnand->Init.MemoryDataWidth);
  status = HAL_MDMA_Start(hdmaData, srcAddress, dstAddress, size, hnand->EccState.SectorCount);
  if (status != HAL_OK)
  {
    hnand->State = HAL_ERROR;
    hnand->ErrorCode = HAL_NAND_ERROR_DMA;
    return status;
  }

  /* Configure DMA channel for reading ECC if needed. */
  if (!WriteFlag && !RawFlag)
  {
    hdmaEcc = hnand->SequencerConfig.HdmaReadEcc;
    srcAddress = hnand->Init.EccAlgorithm == FMC_NAND_ECC_ALGO_HAMMING ? (uint32_t)&hnand->Instance->HECCR :
                 (uint32_t)&hnand->Instance->BCHDSR0;
    dstAddress = (uint32_t)hnand->SequencerConfig.EccBuffer;
    size = HAL_NAND_Sequencer_GetEccWordsPerSector(hnand) * 4;
    status = HAL_MDMA_Start(hdmaEcc, srcAddress, dstAddress, size, hnand->EccState.SectorCount);
    if (status != HAL_OK)
    {
      hnand->State = HAL_ERROR;
      hnand->ErrorCode = HAL_NAND_ERROR_DMA;
      return status;
    }
  }

  /* Clear all sequencer interrupt flags. */
  WRITE_REG(hnand->Instance->CSQICR, FMC_CSQICR_CTCF | FMC_CSQICR_CSCF | FMC_CSQICR_CSEF | FMC_CSQICR_CSUEF |
            FMC_CSQICR_CCMDTCF);
  /* Start the sequencer. */
  MODIFY_REG(hnand->Instance->CSQCR, FMC_CSQCR_CSQSTART, FMC_CSQCR_CSQSTART);

  return status;
}

static HAL_StatusTypeDef HAL_NAND_Sequencer_transferPage(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                         void *pBuffer, bool WriteFlag, bool RawFlag)
{
  HAL_StatusTypeDef status = HAL_OK;
  uint32_t nandAddressMax;
  uint32_t nandAddress;

  /* Process Locked */
  __HAL_LOCK(hnand);

  /* Check the NAND controller state */
  if (hnand->State == HAL_NAND_STATE_READY)
  {
    /* Update the NAND controller state */
    hnand->State = HAL_NAND_STATE_BUSY;

    /* Initialize the error code */
    hnand->ErrorCode = HAL_NAND_ERROR_NONE;

    hnand->SequencerState.TransferPending = true;
    hnand->SequencerState.WriteFlag = WriteFlag;
    hnand->SequencerState.RawFlag = RawFlag;
    hnand->SequencerState.Data = pBuffer;

    HAL_NAND_ECC_ResetErrorCounters(hnand);

    /* NAND raw address calculation */
    nandAddress = ARRAY_ADDRESS(pAddress, hnand);
    nandAddressMax = hnand->Config.BlockSize * hnand->Config.BlockNbr;

    if (nandAddress < nandAddressMax)
    {
      HAL_NAND_Sequencer_setup(hnand, nandAddress, WriteFlag, RawFlag);

      status = HAL_NAND_Sequencer_startTransfer(hnand, pBuffer, WriteFlag, RawFlag);
      if (status != HAL_OK)
      {
        __HAL_UNLOCK(hnand);
      }
    }
  }
  else
  {
    hnand->ErrorCode = HAL_NAND_ERROR_BUSY;
    __HAL_UNLOCK(hnand);
    status = HAL_BUSY;
  }

  return status;
}

/**
  * @brief  Read Page(s) from NAND memory block with error correction using the sequencer (8-bit addressing)
  * If no error occurred, HAL_OK is returned.
  * If an error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_Read_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                  uint8_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, false, true);
}

/**
  * @brief  Read Page(s) from NAND memory block with error correction using the sequencer (16-bit addressing)
  * If no error occurred, HAL_OK is returned.
  * If an error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_Read_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                   uint16_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, false, true);
}

/**
  * @brief  Read Page(s) from NAND memory block with error correction using the sequencer (8-bit addressing)
  * If no error occurred, HAL_OK is returned.
  * If read errors cannot be corrected with ECC, HAL_OK is returned and hnand->EccState.ErrorCount gives the number of
  * error found.
  * If a non-ECC error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @retval HAL status
  */
HAL_StatusTypeDef  HAL_NAND_Sequencer_ECC_Read_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                       uint8_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, false, false);
}

/**
  * @brief  Read one page from NAND memory with error correction using the sequencer (16-bit addressing)
  * If no error occurred, HAL_OK is returned.
  * If read errors cannot be corrected with ECC, HAL_OK is returned and hnand->EccState.ErrorCount gives the number of
  * error found.
  * If a non-ECC error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to destination read buffer
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_ECC_Read_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                       uint16_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, false, false);
}

/**
  * @brief  Write one page to NAND memory using the sequencer
  * If no error occurred, HAL_OK is returned.
  * If an error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_Write_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                   uint8_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, true, true);
}

/**
  * @brief  Write page to NAND memory using the sequencer
  * If no error occurred, HAL_OK is returned.
  * If an error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                    uint16_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, true, true);
}

/**
  * @brief  Write one page to NAND memory with error correction using the sequencer
  * If no error occurred, HAL_OK is returned.
  * If an error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_ECC_Write_Page_8b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                       uint8_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth == NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, true, false);
}

/**
  * @brief  Write one page to NAND memory with error correction using the sequencer
  * If no communication error occurred, HAL_OK is returned and hnand->EccState.ErrorCount gives the number of
  * error found.
  * If an error occurred, a value different of HAL_OK is returned.
  * @param  hnand pointer to a NAND_HandleTypeDef structure that contains
  *                the configuration information for NAND module.
  * @param  pAddress  pointer to NAND address structure
  * @param  pBuffer  pointer to source buffer to write
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_NAND_Sequencer_ECC_Write_Page_16b(NAND_HandleTypeDef *hnand, NAND_AddressTypeDef *pAddress,
                                                        uint16_t *pBuffer)
{
  assert(hnand->Init.MemoryDataWidth != NAND_BUS_WIDTH_8);
  return HAL_NAND_Sequencer_transferPage(hnand, pAddress, pBuffer, true, false);
}

#endif /* HAL_MDMA_MODULE_ENABLED  */

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */

#endif /* HAL_NAND_MODULE_ENABLED  */

/**
  * @}
  */


